app/controllers/users_controller.rb

  def index
    if params[:filter]
      unless params[:field] == "all_columns"
        fields = params[:field]
      else
        fields = %w(login_name first_name last_name role)
      end
      @users = case params[:method]
               when "start_with" then User.start_with(fields, params[:query])
               when "equals" then User.equals(fields, params[:query])
               when "not_equal_to" then User.not_equal_to(fields, params[:query])
               when "contains" then User.contains(fields, params[:query])
               else User.does_not_contain(fields, params[:query])
               end
      @users = @users.page(params[:currentPage], params[:perPage], params[:numPages])
    else
      @users = User.page(params[:currentPage], params[:perPage], params[:numPages])
---
SELECT "users".* FROM "users" WHERE (login_name LIKE '%') ORDER BY id asc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (login_name LIKE '%')

  def create
    @user = User.create params[:user]
---
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "failed_attempts", "first_name", "last_name", "last_sign_in_at", "last_sign_in_ip", "locked_at", "login_name", "region", "remember_created_at", "reset_password_sent_at", "reset_password_token", "role", "sign_in_count", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find params[:id]
    @user.update_attributes params[:user]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY id asc LIMIT 1  [["id", "8"]]
UPDATE "users" SET "first_name" = 'afroO', "lastName" = 'afroO', "email" = 'afroO@gmail.com', "region" = 'North', "role" = 'Administrator', "updated_at" = '2013-01-22 16:14:40.639502' WHERE "users"."id" = 8

  def destroy
    respond_with User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]